"CIAdditionCompositing" = "Aggiungi componenti colore per ottenere l'effetto di luminosità desiderato. Questo filtro viene utilizzato di solito per aggiungere effetti lente e punti luce.";"CIAffineClamp" = "Esegue una trasformazione affine su un'immagine sorgente, quindi fissa i pixel ai margini dell'immagine trasformata, estendendoli vero l'esterno. Questo filtro ha effetti simili al filtro CIAffineTransform, a eccezione del fatto che questo produce di un'immagine con estensione infinita. Puoi utilizzare questo filtro quando desideri sfuocare un'immagine evitando la formazione di una frangia tenue nera lungo i margini.";"CIAffineTile" = "Applica una trasformazione affine a un'immagine, quindi dispone l'immagine trasformata in mosaico.";"CIAffineTransform" = "Applica una trasformazione affine a un'immagine. Puoi scalare, translare, o ruotare l'immagine di input. Puoi inoltre applicare una combinazione di queste operazioni.";"CIBarsSwipeTransition" = "Esegue la transizione da un'immagine a un'altra scoprendo porzioni rettangolari dell'immagine in primo piano fino a mostrare l'immagine risultante.";"CIBlendWithMask" = "Utilizza valori da una maschera della scala dei grigi per interpolare tra un'immagine e lo sfondo. Quando un valore maschera è pari 0.0, il risultato è lo sfondo. Quando il valore maschera è pari a 1.0, il risultato è l'immagine.";"CIBloom" = "Smussa i contorni e applica un piacevole effetto luce all'immagine.";"CIBoxBlur" = "Appiattisce o aguzza un'immagine utilizzando un kernel di convoluzione a caselle.";"CIBumpDistortion" = "Crea un rigonfiamento concavo o convesso che ha origine in un punto specifico dell'immagine.";"CIBumpDistortionLinear" = "Crea un rigonfiamento che ha origine da una porzione lineare dell'immagine.";"CICMYKHalftone" = "Crea una resa colore mezzetinte dell'immagine sorgente, utilizzando inchiostri ciano, magenta, giallo e nero su una pagina bianca.";"CICheckerboardGenerator" = "Genera un motivo a scacchiera. Puoi specificare dimensioni e colori della scacchiera, e la nitidezza del motivo.";"CICircleSplashDistortion" = "Genera una distorsione dei pixel che parte dalla circonferenza di un cerchio e si estende verso l'esterno.";"CICircularScreen" = "Simula uno schermo a mezzetinte di forma circolare.";"CICircularWrap" = "Dispone l'immagine attorno a un cerchio trasparente. La distanza dell'immagine aumenta man mano che ci si allontana dal centro del cerchio.";"CIColorControls" = "Regola i valori di saturazione, luminosità e costrasto.";"CIColorCube" = "Utilizza una tabella colore tridimensionale per trasformare i pixel dell'immagine sorgente. La tabella colore deve essere composta di celle RGBA virgola mobile che utilizzano alfa premoltiplicato. Le celle sono organizzate in ordine standard. Le colonne e righe dei dati sono indicizzate per rosso e verde rispettivamente. Ogni piano dati è seguito dal piano successivo più alto nei dati, con i piani indicizzati per blu.";"CIColorInvert" = "Inverte i colori in un'immagine.";"CIColorMap" = "Esegue una trasformazione non lineare dei valori del colore sorgente utilizzando valori di mappatura forniti in una tabella.";"CIColorMatrix" = "Moltiplica i valori del colore sorgente e aggiunge un fattore di deviazione a ciascun componente colore.";"CIColorMonochrome" = "Esegue la rimappatura dei colori di modo che rientrino nelle gradazioni di un unico colore.";"CIColorPosterize" = "Esegue la rimappatura dei componenti colore rosso, verde e blu al numero dei valori luminosità specificati per ciascun componente colore. Questo filtro appiattisce i colori per ottenere un effetto simile a quello della serigrafia di un poster.";"CIComicEffect" = "Simula un disegno stile fumetto delineando i contorni e applicando un effetto colore mezzetinte.";"CIConstantColorGenerator" = "Genera un colore uniforme. Solitamente l'output di questo filtro viene utilizzato come input di un altro filtro.";"CICopyMachineTransition" = "Esegue la transizione da un'immagine a un'altra simulando l'effetto di una macchina fotocopiatrice.";"CICrop" = "Applica un ritaglio a un'immagine. Le dimensioni e la forma di un'immagine ritagliata dipendono dal rettangolo specificato.";"CICrystallize" = "Crea blocchi di colore a forma di poligono aggregando valori del colore-pixel sorgente.";"CIDiscBlur" = "Appiattisce o aguzza un'immagine utilizzando un kernel di convoluzione a caselle a forma di disco.";"CIDisintegrateWithMaskTransition" = "Esegue la transizione da un'immagine a un'altra utilizzando la forma definita da una maschera.";"CIDisplacementDistortion" = "Applica i valori della scala dei grigi della seconda immagine alla prima immagine. La texture dell'immagine di output è definita dai valori della scala dei grigi.";"CIDissolveTransition" = "Utilizza una dissolvenza per eseguire la transizione da un'immagine a un'altra.";"CIDotScreen" = "Simula i motivi a punti dello schermo a mezzetinte.";"CIEdges" = "Trova tutti i contorni in un'immagine e li visualizza con un colore.";"CIEdgeWork" = "Crea una resa stilizzata in bianco e nero di un'immagine simile a un ritaglio woodblock.";"CIEightfoldReflectedTile" = "Genera un'immagine a caselle da un'immagine sorgente applicando una simmetria riflessa in 8 direzioni.";"CIExposureAdjust" = "Regola l'impostazione di esposizione per un'immagine in modo simile a come viene controllata l'esposizione in una macchina fotografica tramite l'apertura del diaframma.";"CIFalseColor" = "Esegue la mappatura della luminanza in un color ramp a due colori. Il falso colore è spesso utilizzato per l'elaborazione di dati astronomici o altri dati scientifici, come le immagini a raggi ultravioletti e a raggi x.";"CIFastBoxBlur" = "Appiattisce o aguzza un'immagine utilizzando un kernel di convoluzione a caselle.";"CIFastDiscBlur" = "Appiattisce o aguzza un'immagine utilizzando un kernel di convoluzione a caselle a forma di disco.";"CIFlashTransition" = "Esegue la transizione da un'immagine a un'altra creando un flash. Il flash ha origine in un punto determinato. Piccolo dapprima, si espande rapidamente fino a coprire completamente il fotogramma dell'immagine con il colore del flash. Man mano che il colore si dissolve, l'immagine finale comincia ad apparire.";"CIFourfoldReflectedTile" = "Genera un'immagine a caselle da un'immagine sorgente applicando una simmetria riflessa in 4 direzioni.";"CIFourfoldRotatedTile" = "Genera un'immagine a caselle da un'immagine sorgente ruotando la sorgente per multipli di 90 gradi.";"CIFourfoldTranslatedTile" = "Genera un'immagine a caselle da un'immagine sorgente applicando operazioni a 4 traslazioni.";"CIGammaAdjust" = "Regola la luminosità a mezzotono. Questo filtro viene solitamente impiegato per compensare gli effetti non lineari dei monitor. La regolazione di gamma modifica efficacemente l'inclinazione della transizione tra nero e bianco.";"CIGaussianBlur" = "Diffonde i pixel sorgente secondo una quantità specificata dalla distribuzione gaussiana.";"CIGaussianGradient" = "Genera un gradiente che varia da un colore a un altro utilizzando una distribuzione gaussiana.";"CIGlassDistortion" = "Crea una distorsione di un'immagine applicando una texture vitrea. Le porzioni sollevate dell'immagine di output sono il risultato dell'applicazione di una texture map.";"CIGlassLozenge" = "Crea una lente a forma di losanga e crea una distorsione della porzione dell'immagine su cui è collocata la lente.";"CIGlideReflectedTile" = "Genera un'immagine a caselle da un'immagine sorgente traslando e sfumando l'immagine.";"CIGloom" = "Attenua i punti luce di un'immagine.";"CIHatchedScreen" = "Simula il motivo ombreggiato di uno schermo a mezzetinte.";"CIHeightFieldFromMask" = "Genera un campo altezza continuo tridimensionale a forma di loft a partire da una maschera della scala dei grigi. I valori del bianco della maschera definiscono i pixel all'interno del campo altezza mentre i valori del nero definiscono i pixel al di fuori. Il campo varia in modo fluido e continuo all'interno della maschera, raggiungendo il valore 0 ai margini della maschera. Puoi utilizzare questo filtro con il filtro CIShadedMaterial per produrre oggetti ombreggiati realistici.";"CIHexagonalPixellate" = "Visualizza un'immagine come esagoni colorati il cui colore è una media dei pixel che questi vanno a sostituire.";"CIHoleDistortion" = "Crea un'area circolare che spinge i pixel dell'immagine verso l'esterno, creando una distorsione dei pixel più vicini al cerchio.";"CIHueAdjust" = "Modifica la tonalità o tinta d'insieme dei pixel sorgente.";"CIKaleidoscope" = "Genera un'immagine caleidoscopica da un'immagine sorgente applicando una simmetria in 12 direzioni.";"CILanczosScaleTransform" = "Genera una versione in scala di alta qualità di un'immagine sorgente. Solitamente questo filtro viene utilizzato per rimpicciolire un'immagine.";"CILenticularHaloGenerator" = "Simula un alone generato dalla diffrazione dovuta alla diffusione di una lente. Il filtro viene solitamente applicato a un'altra immagine per simulare il riflesso lente e altri effetti simili.";"CILineOverlay" = "Genera un schizzo che delinea i contorni di un'immagine in nero, rendendo trasparente la porzione non delineata. Il risultato ha alfa e viene reso in nero, di modo da non essere ben visibile fino all'esecuzione del rendering su un'altra immagine utilizzando sorgente su compositing.";"CILineScreen" = "Simula il motivo linea di uno schermo a mezzetinte.";"CILinearGradient" = "Genera un gradiente che varia lungo un asse lineare tra due punti di termine definiti.";"CIMaskToAlpha" = "Converte una immagine della scala dei grigi in un'immagine bianca mascherata da alfa. I valori del bianco dall'immagine sorgente generano la parte interiore della maschera; i valori del nero diventano completamente trasparenti.";"CIMaximumCompositing" = "Computa il valore massimo, per componente di colore, di due immagini di input e crea un'immagine di output utilizzando i valori massimi. Questo effetto è simile all'effetto schermatura.";"CIMedianFilter" = "Computa il valore intermedio di un gruppo di pixel vicini e sostituisce ogni valore pixel con quello intermedio. Questo effetto riduce il disturbo.";"CIMinimumCompositing" = "Computa il valore minimo, per componente di colore, di due immagini di input e crea un'immagine di output utilizzando i valori minimi. Questo effetto è simile all'effetto bruciatura.";"CIModTransition" = "Esegue la transizione da un'immagine a un'altra rivelando l'immagine finale attraverso fori di forma irregolare.";"CIMotionBlur" = "Sfoca un'immagine per simulare l'effetto di una fotocamera che si sposta con una distanza e un'angolazione specifiche durante l'acquisizione dell'immagine.";"CIMultiplyCompositing" = "Moltiplica il componente colore di due immagini input e crea un'immagine output utilizzando i valori moltiplicati. Questo filtro viene solitamente utilizzato per aggiungere un effetto riflettore o un effetto di illuminazione simile all'immagine.";"CINoiseReduction" = "Riduce il disturbo utilizzando un valore soglia per definire il concetto di disturbo. Piccole modifiche nella luminanza al di sotto di quel valore sono considerate disturbo e prevedono l'applicazione della riduzione del disturbo, sotto forma di una sfocatura locale. Modifiche al di sopra del valore soglia sono considerate contorni, e prevedono quindi un rafforzamento del contrasto.";"CIOpTile" = "Segmenta un'immagine, applicando scala e rotazione specifiche, quindi riassembla l'immagine per dare un effetto di arte ottica.";"CIPageCurlTransition" = "Esegue la transizione da un'immagine a un'altra simulando l'effetto di una pagina arricciata, che rivela la nuova immagine mentre si piega.";"CIParallelogramTile" = "Curva un'immagine riflettendola in un parallelogramma, quindi dispone il risultato a mosaico.";"CIPerspectiveTile" = "Applica una trasformazione di prospettiva a un'immagine, quindi dispone il risultato in mosaico.";"CIPerspectiveTransform" = "Altera la geometria di un'immagine per simulare il cambiamento di visuale dell'osservatore. Puoi utilizzare il filtro prospettiva per distorcere un'immagine.";"CIPinchDistortion" = "Crea un'area di forma rettangolare che comprimono i pixel sorgente verso l'interno, creando una distorsione dei pixel più vicini al rettangolo.";"CIPixellate" = "Genera un effetto a blocchi dell'immagine.";"CIPointillize" = "Genera un rendering dell'immagine sorgente in stile puntinista.";"CIRadialGradient" = "Genera un gradiente che varia radialmente tra due cerchi con lo stesso centro. Uno dei due cerchi può avere un raggio pari a 0.";"CIRandomGenerator" = "Genera un'immagine dalla larghezza infinita i cui valori pixel sono composti da quattro numeri casuali, distribuiti uniformemente e indipendenti, tra 0 e 1.";"CIRippleTransition" = "Esegue la transizione da un'immagine a un'altra creando un'onda circolare che si espande dal punto centrale, rivelando la nuova immagine sulla scia dell'onda.";"CISepiaTone" = "Esegue la mappatura dei colori di un'immagine a diverse gradazioni di marrone.";"CIShadedMaterial" = "Genera un'immagine ombreggiata da un campo altezza. Il campo altezza è impostato per avere maggiore altezza con ombre più chiare, e minore altezza (aree inferiori) con ombre più scure. Puoi combinare questo filtro con il filtro CIHeightFieldFromMask per generare veloci ombreggiature di maschere, come ad esempio testo.";"CISharpenLuminance" = "Amplia il dettaglio dell'immagine rafforzando il contrasto. Agisce sulla luminanza dell'immagine; la crominanza dei pixel rimane inalterata.";"CISixfoldReflectedTile" = "Genera un'immagine a caselle da un'immagine sorgente applicando una simmetria riflessa in 6 direzioni.";"CISixfoldRotatedTile" = "Genera un'immagine a caselle da un'immagine sorgente ruotando la sorgente per multipli di 60 gradi.";"CISourceAtopCompositing" = "Colloca l'immagine sorgente su un'immagine di sfondo, quindi utilizza la luminanza dell'immagine di sfondo per determinare cosa mostrare. L'immagine composita mostra l'immagine di sfondo e solamente le porzioni dell'immagine di sfondo che si trovano al di sopra di parti visibili dello sfondo. ";"CISourceInCompositing" = "Utilizza la seconda immagine per definire che cosa lasciare nell'immagine sorgente, ritagliando l'immagine in modo efficace.";"CISourceOutCompositing" = "Utilizza la seconda immagine per definire che cosa rimuovere dalla prima immagine.";"CISourceOverCompositing" = "Colloca la seconda immagine sulla prima.";"CISpotColor" = "Sostituisce una o più gamme di colore con colori dell'occhio di bue.";"CISpotLight" = "Applica un effetto occhio di bue direzionale a un'immagine.";"CIStarShineGenerator" = "Genera un motivo esplosione stellare. L'immagine di output viene solitamente utilizzata come input per un altro filtro.";"CIStripesGenerator" = "Genera un motivo a strisce. Puoi controllare il colore delle strisce, la spaziatura e il contrasto.";"CISunbeamsGenerator" = "Genera un effetto sole. Solitamente l'output del filtro raggi di sole può essere utilizzato come input per un filtro composito.";"CISwipeTransition" = "Esegue la transizione da un'immagine a un'altra simulando un colpo di scopa. ";"CITorusLensDistortion" = "Crea una lente a forma di toro e crea una distorsione della porzione dell'immagine su cui è collocata la lente.";"CITriangleTile" = "Esegue la mappatura di una porzione triangolare di un'immagine a un'area triangolare, quindi dispone il risultato in mosaico.";"CITwelvefoldReflectedTile" = "Genera un'immagine a caselle da un'immagine sorgente applicando una simmetria riflessa in 12 direzioni.";"CITwirlDistortion" = "Ruota i pixel attorno a un punto per conferirgli un effetto a spirale. Puoi specificare il numero di rotazioni, nonché il centro e il raggio dell'effetto.";"CIUnsharpMask" = "Aumenta il contrasto dei contorni tra pixel in diversi colori di un'immagine.";"CIVortexDistortion" = "Ruota i pixel attorno a un punto per simulare un vortice. Puoi specificare il numero di rotazioni, nonché il centro e il raggio dell'effetto.";"CIWhitePointAdjust" = "Regola il punto bianco di riferimento per un'immagine e esegue una mappatura di tutti i colori della sorgente utilizzando il nuovo riferimento.";"CIZoomBlur" = "Simula l'effetto zoom della macchina fotografica durante l'acquisizione di un'immagine.";"CIColorBlendMode" = "Utilizza i valori di luminanza dello sfondo con i valori di tonalità e saturazione dell'immagine sorgente. Questa modalità preserva i livelli di grigio nell'immagine.";"CIColorBurnBlendMode" = "Scurisce i campioni dell'immagine di sfondo di modo che coincidano con quelli dell'immagine sorgente. I valori del campione dell'immagine sorgente che specificano bianco non apportano modifiche.";"CIColorDodgeBlendMode" = "Schiarisce i campioni dell'immagine di sfondo di modo che coincidano con quelli dell'immagine sorgente. I valori del campione dell'immagine sorgente che specificano nero non apportano modifiche.";"CIDarkenBlendMode" = "Crea campioni di immagini composite scegliendo i campioni più scuri (dall'immagine sorgente o dallo sfondo). Nel risultato i campioni immagine dello sfondo sono sostituiti dai campioni dell'immagine sorgente più scuri. Altrimenti, i campioni dell'immagine di sfondo rimangono inalterati.";"CIDifferenceBlendMode" = "Sottrae il colore del campione di immagine sorgente dal colore del campione dell'immagine di sfondo, o viceversa, a seconda di quale campione ha i maggiori valori di luminosità. I valori del campione di immagine sorgente neri non apportano modifiche; quelli bianchi invertono i valori del colore di sfondo.";"CIExclusionBlendMode" = "Genera un effetto simile a quello prodotto dal filtro CIDifferenceBlendMode, ma con minore contrasto. I valori del campione dell'immagine sorgente neri non apportano modifiche; quelli bianchi invertono i valori del colore di sfondo.";"CIHardLightBlendMode" = "Moltiplica o filtra colori, a seconda del colore campione dell'immagine sorgente. Se il colore campione dell'immagine sorgente è più chiaro di 50% grigio, lo sfondo viene schiarito, in modo simile al filtraggio. Se il colore campione dell'immagine sorgente è più scuro di 50% grigio, lo sfondo viene schiarito, in modo simile alla moltiplicazione. Se il colore campione dell'immagine sorgente è uguale a 50% grigio, l'immagine sorgente non viene alterata. I campioni immagine uguali a nero totale o bianco totale avranno un risultato completamente nero o completamente bianco. L'effetto finale è simile a quello  che si ottiene illuminando l'immagine sorgente con una fonte di luce intensa.";"CIHueBlendMode" = "Utilizza i valori di luminanza e saturazione dello sfondo con la tonalità dell'immagine sorgente.";"CILightenBlendMode" = "Crea campioni di immagini composite scegliendo i campioni più chiari (dall'immagine sorgente o dallo sfondo). Nel risultato i campioni immagine dello sfondo sono sostituiti dai campioni dell'immagine sorgente più chiari. Altrimenti, i campioni dell'immagine di sfondo rimangono inalterati.";"CILuminosityBlendMode" = "Utilizza la tonalità e la saturazione dello sfondo con la luminanza dell'immagine sorgente. Questa modalità crea un effetto inverso a quello generato dal filtro CIColorBlendMode.";"CIMultiplyBlendMode" = "Moltiplica i campioni dell'immagine sorgente con i campioni dell'immagine di sfondo. Nell'immagine risultante i colori sono scuri almeno tanto quanto uno dei due colori campione aggiunti.";"CIOverlayBlendMode" = "Moltiplica o filtra i campioni dell'immagine sorgente con i campioni dell'immagine di sfondo, a seconda del colore di sfondo. Nel risultato si ottiene una sovrapposizione dei campioni immagine esistenti, mentre vengono conservati i punti luce e le ombre dello sfondo. Il colore di sfondo si mescola con l'immagine sorgente per conferire la stessa luminosità o oscurità dello sfondo.";"CISaturationBlendMode" = "Utilizza i valori di luminanza e tonalità dello sfondo con la saturazione dell'immagine sorgente. Aree dello sfondo che non hanno saturazione (ovvero, aree interamente grigie) non generano modifiche.";"CIScreenBlendMode" = "Moltiplica l'inverso dei campioni dell'immagine sorgente con l'inverso dei campioni dell'immagine di sfondo. Nell'immagine risultante i colori sono chiari almeno tanto quanto une dei due colori campione aggiunti.";"CISoftLightBlendMode" = "Scurisce o schiarisce colori, a seconda del colore campione dell'immagine sorgente. Se il colore campione dell'immagine sorgente è più chiaro di 50% grigio, lo sfondo viene schiarito, in modo simile all'effetto schermatura. Se il colore campione dell'immagine sorgente è più scuro di 50% grigio, lo sfondo viene schiarito, in modo simile all'effetto bruciatura. Se il colore campione dell'immagine sorgente è uguale a 50% grigio, lo sfondo non viene alterato. I campioni immagine uguali a nero totale o bianco totale avranno un risultato completamente nero o completamente bianco. L'effetto finale è simile a quello  che si ottiene illuminando l'immagine sorgente con una fonte di luce diffusa.";"outputImage" = "L'immagine generata da un filtro.";"inputBackgroundImage" = "L'immagine da utilizzare come immagine di sfondo.";"inputImage" = "L'immagine da utilizzare come immagine di input. Per filtri che utilizzano anche un'immagine di sfondo, questa è l'immagine in primo piano.";"inputTime" = "La durata dell'effetto.";"inputTransform" = "Una trasformazione da applicare.";"inputScale" = "La quantità dell'effetto.";"inputAspectRatio" = "Un aspect ratio.";"inputCenter" = "Il centro dell'area, come le coordinate x e y, da filtrare.";"inputRadius" = "La distanza dal centro dell'effetto.";"inputAngle" = "Un angolo.";"inputRefraction" = "L'indice di rifrazione del materiale (come il vetro) utilizzato nell'effetto.";"inputWidth" = "La larghezza dell'effetto.";"inputSharpness" = "La quantità di contrasto da applicare.";"inputIntensity" = "L'intensità dell'effetto.";"inputEV" = "Il numero di aperture del diaframma più chiare o più scure per la creazione dell'immagine.";"inputSaturation" = "La quantità per la regolazione della saturazione.";"inputColor" = "Un colore.";"inputBrightness" = "Un livello di luminosità.";"inputContrast" = "Un livello di contrasto.";"inputGradientImage" = "Un a mappa di ambiente con alfa. Solitamente, questa immagine contiene punti di luce e ombre.";"inputMaskImage" = "Un'immagine maschera.";"inputShadingImage" = "Un a mappa di ambiente con valori alfa. Solitamente, questa immagine contiene punti di luce e ombre.";"inputTargetImage" = "L'immagine finale per la transizione.";"inputExtent" = "Un rettangolo che definisce la larghezza dell'effetto.";"CIBoxBlur.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la sfocatura. Più ampio è il raggio, più sfocato sarà il risultato.";"CIDiscBlur.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la sfocatura. Più ampio è il raggio, più sfocato sarà il risultato.";"CIGaussianBlur.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la sfocatura. Più ampio è il raggio, più sfocato sarà il risultato.";"CIMotionBlur.inputRadius" ="Il raggio determina quanti pixel sono utilizzati per creare la sfocatura. Più ampio è il raggio, più sfocato sarà il risultato.";"CIMotionBlur.inputAngle" = "L'angolazione del movimento determina in quale direzione la sfocatura si diffonde.";"CINoiseReduction.inputNoiseLevel" = "La quantità di riduzione del disturbo. Maggiore è il valore, maggiore sarà la riduzione disturbo.";"CINoiseReduction.inputSharpness" = "La nitidezza dell'immagine finale. Maggiore è il valore, più nitido sarà il risultato.";"CIZoomBlur.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";"CIZoomBlur.inputAmount" = "La quantità di ingrandimento. Valori maggiori generano un ingrandimento maggiore.";"CIColorControls.inputSaturation" = "La quantità di saturazione da applicare. Maggiore è il valore, più saturato sarà il risultato.";"CIColorControls.inputBrightness" = "La quantità di luminosità da applicare. Maggiore è il valore, più luminoso sarà il risultato.";"CIColorControls.inputContrast" = "La quantità di contrasto da applicare. Maggiore è il valore, maggiore sarà il contrasto nell'immagine risultante.";"CIColorMatrix.inputRVector" = "La quantità di rosso per cui moltiplicare i valori di colore sorgente.";"CIColorMatrix.inputGVector" = "La quantità di verde per cui moltiplicare i valori di colore sorgente.";"CIColorMatrix.inputBVector" = "La quantità di blu per cui moltiplicare i valori di colore sorgente.";"CIColorMatrix.inputAVector" = "La quantità di alfa per cui moltiplicare i valori di colore sorgente.";"CIColorMatrix.inputBiasVector" = "Un vettore che viene aggiunto a ciascun componente colore.";"CIExposureAdjust.inputEV" = "La quantità da utilizzare per la regolazione dell'esposizione dell'immagine. Maggiore è il valore, più luminosa sarà l'immagine.";"CIGammaAdjust.inputPower" = "Un valore gamma da utilizzare per la correzione della luminosità dell'immagine. Maggiore  è il valore, più scuro sarà il risultato.";"CIHueAdjust.inputAngle" = "Un'angolazione (in gradi) da utilizzare per la correzione della tonalità di un'immagine.";"CIWhitePointAdjust.inputColor" = "Un colore da utilizzare come punto bianco.";"CIColorCube.inputDimension" = "La dimensione della tabella colore.";"CIColorCube.inputCubeData" = "Questa è una tabella colore delle celle RGBA virgola mobile che utilizzano alfa premoltiplicato. Le celle sono organizzate in ordine standard. Le colonne e le righe dei dati sono indicizzate per rosso e verde rispettivamente. Ciascun piano dati è seguito dal piano successivo più alto nei dati, con i piani indicizzati per blu.";"CIColorMap.inputGradientImage" = "I dati immagine di questa immagine trasformano i valori dell'immagine sorgente.";"CIColorMonochrome.inputColor" = "Il colore monocromo da applicare all'immagine.";"CIColorMonochrome.inputIntensity" = "L'intensità dell'effetto monocromo. Un valore di 1.0 crea un'immagine monocroma utilizzando il colore fornito. Un valore pari a 0.0 non ha effetto sull'immagine.";"CIColorPosterize.inputLevels" = "Il numero dei livelli di luminosità da utilizzare per ciascun componente colore. Valori più bassi creano un effetto poster più estremo.";"CIFalseColor.inputColor0" = "Il primo colore da utilizzare per il color ramp.";"CIFalseColor.inputColor1" = "Il secondo colore da utilizzare per il color ramp.";"CISepiaTone.inputIntensity" = "L'intensità dell'effetto seppia. Un valore di 1.0 crea un'immagine seppia monocroma. Un valore pari a 0.0 non ha effetto sull'immagine.";"CIBumpDistortion.inputCenter" = "La posizione x e y da utilizzare come centro del rigonfiamento."; "CIBumpDistortion.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la distorsione. Più ampio è il raggio, maggiore sarà il grado di distorsione."; "CIBumpDistortion.inputScale" = "La scala dell'effetto determina la curvatura del rigonfiamento. Un valore di 0.0 non avrà alcun effetto. I valori positivi creano un rigonfiamento verso l'esterno; i valori negativi creano un rigonfiamento verso l'interno."; "CIBumpDistortionLinear.inputCenter" = "La posizione x e y da utilizzare come centro della distorsione."; "CIBumpDistortionLinear.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la distorsione. Più ampio è il raggio, maggiore sarà il grado di distorsione.";  "CIBumpDistortionLinear.inputScale" = "La scala dell'effetto."; "CIBumpDistortionLinear.inputAngle" = "L'angolazione (in gradi) della linea attorno a cui si forma la distorsione."; "CICircleSplashDistortion.inputCenter" = "La posizione x e y da utilizzare come centro della distorsione.";  "CICircleSplashDistortion.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la distorsione. Più ampio è il raggio, maggiore sarà il grado di distorsione.";  "CICircularWrap.inputCenter" = "La posizione x e y da utilizzare come centro della distorsione.";  "CICircularWrap.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la distorsione. Più ampio è il raggio, maggiore sarà il grado di distorsione.";  "CICircularWrap.inputAngle" = "L'angolazione di un effetto."; "CIDisplacementDistortion.inputDisplacementImage" = "Un'immagine i cui valori di scala dei grigi saranno applicati all'immagine sorgente."; "CIDisplacementDistortion.inputScale" = "La quantità di texturizzazione dell'immagine risultante. Più grande è il valore, maggiore sarà la trama."; "CIGlassDistortion.inputTexture" = "Una texture da applicare all'immagine sorgente.";"CIGlassDistortion.inputCenter" = "La posizione x e y da utilizzare come centro della distorsione."; "CIGlassDistortion.inputScale" = "La quantità di texturizzazione dell'immagine risultante. Più grande è il valore, maggiore sarà la trama."; "CIGlassLozenge.inputPoint0" = "La posizione x e y che definiscono il centro del cerchio a un'estremità della losanga."; "CIGlassLozenge.inputPoint1" = "La posizione x e y che definiscono il centro del cerchio nell'altra estremità della losanga.";  "CIGlassLozenge.inputRadius" = "Il raggio della losanga. Maggiore è il raggio, più ampia sarà la distorsione.";  "CIGlassLozenge.inputRefraction" = "La rifrazione del vetro."; "CIHoleDistortion.inputCenter" = "La posizione x e y da utilizzare come centro della distorsione.";  "CIHoleDistortion.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la distorsione. Più ampio è il raggio, maggiore sarà il grado di distorsione.";  "CIPinchDistortion.inputCenter" = "La posizione x e y da utilizzare come centro della distorsione."; "CIPinchDistortion.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la distorsione. Più ampio è il raggio, maggiore sarà il grado di distorsione."; "CIPinchDistortion.inputScale" = "La quantità di distorsione curvilinea. Un valore pari a 0.0 non ha alcun effetto. Un valore pari a1.0 corrisponde alla massima distorsione.";"CITorusLensDistortion.inputCenter" = "La posizione x e y da utilizzare come centro del toro.";  "CITorusLensDistortion.inputRadius" = "Il raggio esterno del toro.";  "CITorusLensDistortion.inputWidth" = "La larghezza dell'anello."; "CITorusLensDistortion.inputRefraction" = "La rifrazione del vetro."; "CITwirlDistortion.inputCenter" = "La posizione x e y da utilizzare come centro della distorsione.";  "CITwirlDistortion.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la distorsione. Più ampio è il raggio, maggiore sarà il grado di distorsione."; "CITwirlDistortion.inputAngle" = "L'angolazione (in gradi) della spirale. I valori possono essere positivi o negativi.";"CIVortexDistortion.inputCenter" = "La posizione x e y da utilizzare come centro della distorsione."; "CIVortexDistortion.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare la distorsione. Più ampio è il raggio, maggiore sarà il grado di distorsione."; "CIVortexDistortion.inputAngle" = "L'angolazione (in gradi) del vortice.";"CICheckerboardGenerator.inputColor0" = "Un colore da utilizzare per la prima serie di caselle della scacchiera.";"CICheckerboardGenerator.inputColor1" = "Un colore da utilizzare per la seconda serie di caselle della scacchiera.";"CICheckerboardGenerator.inputWidth" = "La larghezza di una casella nel motivo a scacchiera.";"CICheckerboardGenerator.inputSharpness" = "La nitidezza del motivo a scacchiera. Minore è il valore, più il motivo sarà sfocato. Il valore varia da 0.0 a 1.0.";"CIConstantColorGenerator.inputColor" = "Il colore da generare."; "CILenticularHaloGenerator.inputCenter" = "La posizione x e y da utilizzare come centro dell'alone.";"CILenticularHaloGenerator.inputHaloRadius" = "Il raggio dell'alone.";"CILenticularHaloGenerator.inputHaloWidth" = "La larghezza dell'alone, dal raggio interno a quello esterno.";"CILenticularHaloGenerator.inputOverlap" = "Las quantità di sovrapposizione dei componenti di diffrazione dell'alone. Un valore pari a 1.0 corrisponde a una sovrapposizione completa; l'alone è bianco. Un valore pari a 0.0 non prevede sovrapposizioni; i colori dell'alone non sono sovrapposti.";"CILenticularHaloGenerator.inputStriationStrength" = "L'intensità dei colori dell'alone. Valori maggiori generano una maggiore intensità.";"CILenticularHaloGenerator.inputStriationContrast" = "Il contrasto dei colori dell'alone. Valori maggiori generano un contrasto maggiore.";"CIStarShineGenerator.inputCenter" = "La posizione x e y da utilizzare come centro della stella."; "CIStarShineGenerator.inputColor" = "Il colore da utilizzare per lo strato esterno della stella circolare."; "CIStarShineGenerator.inputRadius" = "Il raggio della stella."; "CIStarShineGenerator.inputCrossScale" = "Le dimensioni del motivo incrociato."; "CIStarShineGenerator.inputCrossAngle" = "L'angolazione del motivo incrociato."; "CIStarShineGenerator.inputCrossOpacity" = "L'opacità del motivo incrociato."; "CIStarShineGenerator.inputCrossWidth" = "La larghezza del motivo incrociato."; "CIStarShineGenerator.inputEpsilon" = "La lunghezza delle cuspidi incrociate."; "CIStripesGenerator.inputCenter" = "La posizione x e y da utilizzare come centro del motivo a strisce."; "CIStripesGenerator.inputColor0" = "Un colore da utilizzare per le strisce dispari."; "CIStripesGenerator.inputColor1" = "Un colore da utilizzare per le strisce pari.";"CIStripesGenerator.inputWidth" = "La larghezza di una striscia."; "CIStripesGenerator.inputSharpness" = "La nitidezza del motivo a strisce. Minore è il valore, più il motivo sarà sfocato. Il valore varia da 0.0 a 1.0."; "CISunbeamsGenerator.inputCenter" = "Le posizioni x e y da utilizzare come centro del motivo raggio di sole.";"CISunbeamsGenerator.inputColor" = "Il colore del sole.";"CISunbeamsGenerator.inputSunRadius" = "Il raggio del sole.";"CISunbeamsGenerator.inputMaxStriationRadius" = "Il raggio del raggio di sole.";"CISunbeamsGenerator.inputStriationStrength" = "L'intensità dei raggi di sole. Valori maggiori generano maggiore intensità.";"CISunbeamsGenerator.inputStriationContrast" = "Il contrasto del raggio di sole. Valori maggiori generano maggior contrasto.";"CIAffineTransform.inputTransform" = "Una trasformazione da applicare all'immagine."; "CICrop.inputRectangle" = "Il rettangolo che specifica il ritaglio da applicare all'immagine."; "CILanczosScaleTransform.inputScale" = "Il fattore di scala da utilizzare sull'immagine. Valori inferiori a 1.0 rimpiccioliscono l'immagine. Valori superiori a 1.0 ingrandiscono l'immagine."; "CILanczosScaleTransform.inputAspectRatio" = "L'aspect ratio dell'immagine."; "CIPerspectiveTransform.inputTopLeft" = "La coordinata sinistra superiore a cui mappare l'immagine."; "CIPerspectiveTransform.inputTopRight" = "La coordinata destra superiore a cui mappare l'immagine."; "CIPerspectiveTransform.inputBottomRight" = "La coordinata destra inferiore a cui mappare l'immagine."; "CIPerspectiveTransform.inputBottomLeft" = "La coordinata sinistra inferiore per la mappatura dell'immagine."; "CIGaussianGradient.inputColor0" = "Il primo colore da utilizzare nel gradiente."; "CIGaussianGradient.inputColor1" = "Il secondo colore da utilizzare nel gradiente."; "CIGaussianGradient.inputRadius" = "Il raggio della distribuzione gaussiana."; "CILinearGradient.inputPoint0" = "La posizione di partenza del gradiente, ovvero il punto di inizio del primo colore."; "CILinearGradient.inputPoint1" = "La posizione finale del gradiente, ovvero il punto di inizio del secondo colore."; "CILinearGradient.inputColor0" = "Il primo colore da utilizzare nel gradiente.";  "CILinearGradient.inputColor1" = "Il secondo colore da utilizzare nel gradiente.";  "CIRadialGradient.inputRadius0" = "Il raggio del cerchio di partenza da utilizzare nel gradiente.";"CIRadialGradient.inputRadius1" = "Il raggio del cerchio finale da utilizzare nel gradiente.";"CIRadialGradient.inputColor0" = "Il primo colore da utilizzare nel gradiente.";  "CIRadialGradient.inputColor1" = "Il secondo colore da utilizzare nel gradiente."; "CICircularScreen.inputCenter" = "La posizione x e y da utilizzare come centro del motivo schermo circolare."; "CICircularScreen.inputWidth" = "La distanza tra ciascun cerchio nel motivo."; "CICircularScreen.inputSharpness" = "La nitidezza dei cerchi. Maggiore è il valore, più nitidi sono i cerchi."; "CICMYKHalftone.inputCenter" = "La posizione x e y da utilizzare come centro del motivo a mezzi toni.";  "CICMYKHalftone.inputWidth" = "La distanza tra i punti nel motivo."; "CICMYKHalftone.inputAngle" = "L'angolazione del motivo."; "CICMYKHalftone.inputSharpness" = "La nitidezza del motivo. Maggiore è il valore, più nitido sarà il motivo."; "CICMYKHalftone.inputGCR" = "Il valore di sostituzione del componente grigio. Il valore può variare da 0.0 (nessuno) a 1.0."; "CICMYKHalftone.inputUCR" = "Il valore di rimozione del colore inferiore. Il valore può variare da 0.0 a 1.0."; "CIDotScreen.inputCenter" = "La posizione x e y da utilizzare come centro del motivo schermo a punti.";  "CIDotScreen.inputAngle" = "L'angolazione del motivo."; "CIDotScreen.inputWidth" = "La distanza tra i punti nel motivo."; "CIDotScreen.inputSharpness" = "La nitidezza del motivo. Maggiore è il valore, più nitido sarà il motivo."; "CIHatchedScreen.inputCenter" = "La posizione x e y da utilizzare come centro del motivo schermo ombreggiato."; "CIHatchedScreen.inputAngle" = "L'angolazione del motivo.";"CIHatchedScreen.inputWidth" = "La distanza tra linee nel motivo."; "CIHatchedScreen.inputShaprness" = "La nitidezza del motivo. Maggiore è il valore, più nitido sarà il motivo."; "CILineScreen.inputCenter" = "La posizione x e y da utilizzare come centro del motivo schermo circolare.";  "CILineScreen.inputAngle" = "L'angolazione del motivo."; "CILineScreen.inputWidth" = "La distanza tra linee nel motivo."; "CILineScreen.inputSharpness" = "La nitidezza del motivo. Maggiore è il valore, più nitido sarà il motivo."; 	"CISharpenLuminance.inputSharpness" = "La quantità di contrasto da applicare. I valori maggiori hanno maggior contrasto.";"CIUnsharpMask.inputRadius" = "Il raggio attorno a un determinato pixel a cui applicare la maschera di contrasto. Maggiore è il raggio, più l'effetto sarà accentuato.";"CIUnsharpMask.inputIntensity" = "L'intensità dell'effetto. Maggiore è il valore, maggiore sarà il contrasto nell'area interessata.";"CIBlendWithMask.inputMaskImage" = "Una maschera della scala dei grigi. Quando una valore maschera è pari a 0.0, il risultato è lo sfondo. Quando il valore maschera è pari a 1.0, il risultato è l'immagine."; "CIBloom.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare l'effetto. Più ampio è il raggio, maggiore sarà l'effetto.";"CIBloom.inputIntensity" = "L'intensità dell'effetto. Un valore di 0.0 non equivale ad alcun effetto . Un valore di 1.0 equivale al massimo effetto."; "CICrystallize.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare l'effetto. Più ampio è il raggio, più grandi saranno i cristalli risultanti."; "CIEdges.inputIntensity" = "L'intensità dei contorni. Maggiore è il valore, più alta sarà l'intensità."; "CIEdgeWork.inputRadius" = "Lo spessore dei contorni. Maggiore è il valore, più spessi saranno i contorni."; "CIGloom.inputRadius" = "Il raggio determina quanti pixel sono utilizzati per creare l'effetto. Più ampio è il raggio, maggiore sarà l'effetto."; "CIGloom.inputIntensity" = "L'intensità dell'effetto. Un valore di 0.0 non equivale ad alcun effetto . Un valore di 1.0 equivale al massimo effetto."; "CIHeightFieldFromMask.inputImage" = "I valori del bianco della maschera definiscono i pixel all'interno del campo altezza mentre i valori del nero definiscono quelli al di fuori. Il campo varia in modo fluido e continuo all'interno della maschera, raggiungendo un valore pari a 0 ai margini della maschera."; "CIHeightFieldFromMask.inputRadius" = "La distanza dal margine della maschera per la transizione fluida è proporzionale al raggio di input. Valori maggiori rendono la transizione più fluida e pronunciata. Valori minori fanno avvicinare la transizione al raggio di raccordo."; "CIHexagonalPixellate.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto."; "CIHexagonalPixellate.inputScale" = "La scala determina le dimensioni degli esagoni. I valori maggiori genereranno esagoni più grandi."; "CILineOverlay.inputNRNoiseLevel" = "Il livello di disturbo dell'immagine (utilizzato con i dati della fotocamera) che viene rimosso prima di tracciare i contorni dell'immagine. Aumentare il livello di disturbo aiuta a rifinire i margini tracciati dell'immagine."; "CILineOverlay.inputNRSharpness" = "La quantità di contrasto utilizzato nel rimuovere il disturbo nell'immagine prima di tracciare i contorni dell'immagine. Questo facilita l'acquisizione dei contorni."; "CILineOverlay.inputEdgeIntensity" = "Il fattore di accentuazione dell'informazione di gradiente Sobel nel tracciare i margini dell'immagine. Valori più alti rinvengono più contorni, tuttavia solitamente viene impiegato un valore basso (ad esempio, 1.0)."; "CILineOverlay.inputThreshold" = "Questo valore determina la visibilità del contorno. Valori più grandi assottigliano i contorni."; "CILineOverlay.inputContrast" = "La quantità di anti-aliasing da utilizzare sui margini generati da questo filtro. Valori più alti generano margini dal contrasto più alti (con minore anti-aliasing)."; "CIPixellate.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CIPixellate.inputScale" = "La scala determina le dimensioni dei quadrati. I valori maggiori genereranno quadrati più grandi."; "CIPointillize.inputRadius" = "Il raggio dei cerchi nel motivo risultante."; "CIPointillize.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CIShadedMaterial.inputShadingImage" = "L'immagine da utilizzare come campo altezza. L'immagine risultante ha altezze maggiori e ombre più leggere, e altezze minori (aree inferiori) con ombre più scure."; "CIShadedMaterial.inputScale" = "La scala dell'effetto. Maggiore è il valore, più accentuato sarà l'effetto."; "CISpotColor.inputCenterColor1" = "Il valore centrale della gamma del primo colore da sostituire."; "CISpotColor.inputReplacementColor1" = "Un colore di sostituzione per la gamma del primo colore."; "CISpotColor.inputCloseness1" = "Un valore che indica il grado di corrispondenza del primo colore prima che venga sostituito."; "CISpotColor.inputContrast1" = "Il contrasto del primo colore di sostituzione."; "CISpotColor.inputCenterColor2" = "Il valore centrale della gamma del secondo colore da sostituire."; "CISpotColor.inputReplacementColor2" = "Un colore di sostituzione per la gamma del secondo colore.";"CISpotColor.inputCloseness2" = "Un valore che indica il grado di corrispondenza del secondo colore prima che venga sostituito."; "CISpotColor.inputContrast2" = "Il contrasto del secondo colore di sostituzione."; "CISpotColor.inputCenterColor3" = "Il valore centrale della gamma del terzo colore da sostituire.";  "CISpotColor.inputReplacementColor3" = "Un colore di sostituzione per la gamma del terzo colore."; "CISpotColor.inputCloseness3" = "Un valore che indica il grado di corrispondenza del terzo colore prima che venga sostituito.";  "CISpotColor.inputContrast3" = "Il contrasto del terzo colore di sostituzione.";  "CISpotLight.inputLightPosition" = "La posizione x e y dell'occhio di bue."; 		"CISpotLight.inputLightPointsAt" = "La posizione x e y su cui è puntato l'occhio di bue.";  "CISpotLight.inputBrightness" = "La luminosità dell'occhio di bue."; "CISpotLight.inputConcentration" = "Le dimensioni dell'occhio di bue. Minore è il valore, più concentrato sarà il fascio di luce."; "CISpotLight.inputColor" = "Il colore dell'occhio di bue."; "CIAffineClamp.inputTransform" = "La trasformazione da applicare all'immagine."; "CIAffineTile.inputTransform" = "La trasformazione da applicare all'immagine."; "CIEightfoldReflectedTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CIEightfoldReflectedTile.inputAngle" = "L'angolazione (in gradi) del motivo a caselle."; "CIEightfoldReflectedTile.inputWidth" = "La larghezza di una casella."; "CIFourfoldReflectedTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CIFourfoldReflectedTile.inputAngle" = "L'angolazione (in gradi) del motivo a caselle.";  "CIFourfoldReflectedTile.inputAcuteAngle" = "L'angolazione primaria per la casella riflessa ripetuta. Valori bassi creano caselle diamante sottili, mentre valori alti creano caselle riflesse più spesse."; "CIFourfoldReflectedTile.inputWidth" = "La larghezza di una casella.";  "CIFourfoldRotatedTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CIFourfoldRotatedTile.inputAngle" = "L'angolazione (in gradi) del motivo a caselle.";  "CIFourfoldRotatedTile.inputWidth" = "La larghezza di una casella."; "CIFourfoldTranslatedTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CIFourfoldTranslatedTile.inputAngle" = "L'angolazione (in gradi) del motivo a caselle.";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "L'angolazione primaria per la casella traslata ripetuta. Valori bassi creano caselle diamante sottili, mentre valori alti creano caselle traslate più spesse."; "CIFourfoldTranslatedTile.inputWidth" = "La larghezza di una casella.";  "CIGlideReflectedTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CIGlideReflectedTile.inputAngle" = "L'angolazione (in gradi) del motivo a caselle.";  "CIGlideReflectedTile.inputWidth" = "La larghezza di una casella.";  "CIKaleidoscope.inputCount" = "Il numero di riflessi nel motivo."; "CIKaleidoscope.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CIKaleidoscope.inputAngle" = "L'inclinazione del riflesso."; "CIOpTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CIOpTile.inputScale" = "La scala determina il numero di caselle nell'effetto."; "CIOpTile.inputAngle" = "L'angolazione di una casella."; "CIOpTile.inputWidth" = "La larghezza di una casella."; "CIParallelogramTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto."; "CIParallelogramTile.inputAngle" = "L'angolazione (in gradi) del motivo a caselle.";  "CIParallelogramTile.inputAcuteAngle" = "L'angolazione primaria per la casella parallelogramma ripetuta. Valori bassi creano caselle diamante sottili, mentre valori alti creano caselle parallelogramma più spesse."; "CIParallelogramTile.inputWidth" = "La larghezza di una casella.";  "CIPerspectiveTile.inputTopLeft" = "La coordinata sinistra superiore di una casella."; "CIPerspectiveTile.inputTopRight" = "La coordinata destra superiore di una casella.";"CIPerspectiveTile.inputBottomRight" = "La coordinata destra inferiore di una casella."; "CIPerspectiveTile.inputBottomLeft" = "La coordinata sinistra inferiore di una casella."; "CISixfoldReflectedTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CISixfoldReflectedTile.inputAngle" = "L'angolazione (in gradi) del motivo a caselle.";  "CISixfoldReflectedTile.inputWidth" = "La larghezza di una casella."; "CISixfoldRotatedTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto."; "CISixfoldRotatedTile.inputAngle" = "L'angolazione (in gradi) del motivo a caselle.";  "CISixfoldRotatedTile.inputWidth" = "La larghezza di una casella.";  "CITriangleTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto.";  "CITriangleTile.inputAngle" = "L'angolazione (in gradi) del motivo a caselle.";  "CITriangleTile.inputWidth" = "La larghezza di una casella.";  "CITwelvefoldReflectedTile.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto."; "CITwelvefoldReflectedTile.inputAngle" = "L'angolazione (in gradi) del motivo a caselle.";"CITwelvefoldReflectedTile.inputWidth" = "La larghezza di una casella."; "CIBarsSwipeTransition.inputAngle" = "L'angolazione (in gradi) delle barre.";	"CIBarsSwipeTransition.inputWidth" = "La larghezza di ciascuna barra.";	"CIBarsSwipeTransition.inputBarOffset" = "Lo sfasamento di una barra rispetto a un'altra.";	"CIBarsSwipeTransition.inputTime" = "Il tempo parametrico della transizione. Questo valore guida la transizione dall'inizio (da tempo 0) alla fine (a tempo 1).";"CICopyMachineTransition.inputColor" = "Il colore della luce fotocopiatrice.";"CICopyMachineTransition.inputAngle" = "L'angolazione della luce fotocopiatrice.";"CICopyMachineTransition.inputWidth" = "La larghezza della luce fotocopiatrice.";"CICopyMachineTransition.inputOpacity" = "L'opacità della luce fotocopiatrice. Un valore pari a 0.0 è trasparente. Un valore pari a 1.0 è opaco.";"CICopyMachineTransition.inputTime" = "Il tempo parametrico della transizione. Questo valore guida la transizione dall'inizio (da tempo 0) alla fine (a tempo 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "Un'immagine che definisce la forma da utilizzare nel passaggio da un'immagine sorgente all'immagine finale.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "Il raggio dell'ombra creato dalla maschera.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "La densità dell'ombra creata dalla maschera.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "Lo scarto dell'ombra creato dalla maschera.";"CIDisintegrateWithMaskTransition.inputTime" = "Il tempo parametrico della transizione. Questo valore guida la transizione dall'inizio (da tempo 0) alla fine (a tempo 1).";"CIDissolveTransition.inputTime" = "Il tempo parametrico della transizione. Questo valore guida la transizione dall'inizio (da tempo 0) alla fine (a tempo 1).";"CIFlashTransition.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto."; "CIFlashTransition.inputExtent" = "L'ampiezza del flash.";"CIFlashTransition.inputColor" = "Il colore dei raggi di luce emanati dal flash.";"CIFlashTransition.inputMaxStriationRadius" = "Il raggio dei raggi di luce emanati dal flash.";"CIFlashTransition.inputStriationStrength" = "La potenza dei raggi di luce emanati dal flash.";"CIFlashTransition.inputStriationContrast" = "Il contrasto dei raggi di luce emanati dal flash.";"CIFlashTransition.inputFadeThreshold" = "La quantità di dissolvenza in chiusura tra il flash e l'immagine finale. Più alto è il valore, maggiore sarà la durata del flash e minore quella della dissolvenza.";"CIFlashTransition.inputTime" = "Il tempo parametrico della transizione. Questo valore guida la transizione dall'inizio (da tempo 0) alla fine (a tempo 1).";"CIModTransition.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto."; "CIModTransition.inputAngle" = "L'angolazione del motivo foro mod.";"CIModTransition.inputRadius" = "Il raggio dei fori non distorti nel motivo.";"CIModTransition.inputCompression" = "La quantità di stretching applicata al motivo foro mod. I fori nel centro non sono distorti tanto quanto quelli ai margini dell'immagine.";"CIModTransition.inputTime" = "Il tempo parametrico della transizione. Questo valore guida la transizione dall'inizio (da tempo 0) alla fine (a tempo 1).";"CIPageCurlTransition.inputBacksideImage" = "L'immagine che appare nel retro dell'immagine sorgente, quando la pagina si arriccia per andare a rivelare l'immagine finale.";"CIPageCurlTransition.inputShadingImage" = "Un'immagine dall'aspetto di una sfera ombreggiata racchiusa in un'immagine quadrata.";"CIPageCurlTransition.inputExtent" = "L'ampiezza dell'effetto.";"CIPageCurlTransition.inputAngle" = "L'angolazione della pagina arricciata.";"CIPageCurlTransition.inputRadius" = "Il raggio dell'arricciatura.";"CIPageCurlTransition.inputTime" = "Il tempo parametrico della transizione. Questo valore guida la transizione dall'inizio (da tempo 0) alla fine (a tempo 1).";"CIRippleTransition.inputShadingImage" = "Un'immagine dall'aspetto di una sfera ombreggiata racchiusa in un'immagine quadrata.";"CIRippleTransition.inputCenter" = "La posizione x e y da utilizzare come centro dell'effetto."; "CIRippleTransition.inputExent" = "L'ampiezza dell'effetto.";"CIRippleTransition.inputWidth" = "La larghezza dell'increspatura.";"CIRippleTransition.inputScale" = "Un valore che determina se l'increspatura inizia come rigonfiamento (valore maggiore) o come rientranza (valore minore).";"CIRippleTransition.inputTime" = "Il tempo parametrico della transizione. Questo valore guida la transizione dall'inizio (da tempo 0) alla fine (a tempo 1).";"CISwipeTransition.inputExtent" = "L'ampiezza dell'effetto.";"CISwipeTransition.inputColor" = "Il colore del colpo.";"CISwipeTransition.inputAngle" = "L'angolazione del colpo.";"CISwipeTransition.inputWidth" = "La larghezza del colpo.";"CISwipeTransition.inputOpacity" = "L'opacità del colpo.";"CISwipeTransition.inputTime" = "Il tempo parametrico della transizione. Questo valore guida la transizione dall'inizio (da tempo 0) alla fine (a tempo 1).";"CIAreaHistogram" = "Calcola un istogramma per l'area specificata di un'immagine, restituendo il risultato in un'immagine 1D.";"CIAreaHistogram.inputExtent" = "Un rettangolo che specifica la sottoregione dell'immagine che desideri elaborare.";"CIAreaHistogram.inputCount" = "Il numero di bin per l'istogramma.";"CIAreaHistogram.inputImage" = "L'immagine di cui desideri calcolare l'istogramma.";"CIAreaHistogram.inputScale" = "Il valore per scala da utilizzare per i valori dell'istogramma.";"CIAreaMaximum" = "Calcola i valori massimi del componente per l'area specificata di un'immagine, restituendo il risultato in un pixel.";"CIAreaMaximum.inputExtent" = "Un rettangolo che specifica la sottoregione dell'immagine che desideri elaborare.";"CIAreaMaximum.inputImage" = "L'immagine da elaborare.";"CIAreaMinimum" = "Calcola i valori minimi del componente per l'area specificata di un'immagine, restituendo il risultato in un pixel.";"CIAreaMinimum.inputExtent" = "Un rettangolo che specifica la sottoregione dell'immagine che desideri elaborare.";"CIAreaMinimum.inputImage" = "L'immagine da elaborare.";"CIAreaMaximumAlpha" = "Cerca e restituisce il pixel con il valore alfa maggiore.";"CIAreaMaximumAlpha.inputExtent" = "Un rettangolo che specifica la sottoregione dell'immagine che desideri elaborare.";"CIAreaMaximumAlpha.inputImage" = "L'immagine da elaborare.";"CIAreaMinimumAlpha" = "Cerca e restituisce il pixel con il valore alfa minore.";"CIAreaMinimumAlpha.inputExtent" = "Un rettangolo che specifica la sottoregione dell'immagine che desideri elaborare.";"CIAreaMinimumAlpha.inputImage" = "L'immagine da elaborare.";"CIAreaAverage" = "Calcola il colore medio per l'area specificata di un'immagine, restituendo il risultato in un pixel.";"CIAreaAverage.inputExtent" = "Un rettangolo che specifica la sottoregione dell'immagine che desideri elaborare.";"CIAreaAverage.inputImage" = "L'immagine da elaborare.";"CIRowAverage" = "Calcola il colore medio per ogni riga dell'area specificata di un'immagine, restituendo il risultato in un'immagine 1D.";"CIRowAverage.inputExtent" = "Un rettangolo che specifica la sottoregione dell'immagine che desideri elaborare.";"CIRowAverage.inputImage" = "L'immagine da elaborare.";"CIColumnAverage" = "Calcola il colore medio per ogni colonna dell'area specificata di un'immagine, restituendo il risultato in un'immagine 1D.";"CIColumnAverage.inputExtent" = "Un rettangolo che specifica la sottoregione dell'immagine che desideri elaborare.";"CIColumnAverage.inputImage" = "L'immagine da elaborare.";"CIMinimumComponent" = "Converte un'immagine in scala dei grigi utilizzando il minimo dei tre componenti colore.";"CIMinimumComponent.inputExtent" = "Un rettangolo che specifica la sottoregione dell'immagine che desideri elaborare.";"CIMinimumComponent.inputImage" = "L'immagine da elaborare.";"CIMaximumComponent" = "Converte un'immagine in scala dei grigi utilizzando il massimo dei tre componenti colore.";"CIMaximumComponent.inputExtent" = "Un rettangolo che specifica la sottoregione dell'immagine che desideri elaborare.";"CIMaximumComponent.inputImage" = "L'immagine da elaborare.";